#    -*- mode: org -*-

# LEEME: Este fichero es el que documenta, con criterio propio y separado del =PlanDeEscritura.org= (que queda fuera del repo), /cómo funciona/ la infraestructura del repositorio.

#+TITLE: Despliegue y publicación de "Principios de Econometría"
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es

* Filosofía general

Este repositorio separa estrictamente /fuentes/ (rama =main=) de
/artefactos generados/ (rama =gh-pages=):

- =main= contiene únicamente ficheros =.org=, figuras =.png=, datos y
  ficheros de configuración (=makefile=, =css/=, =mycfg-GitHubPages.py=,
  =requirements.txt=). Nada generado (pdf, html, ipynb, slides, guiones
  =.inp= de Gretl) se versiona aquí.
- =gh-pages= contiene únicamente lo generado: HTML, PDF, cuadernos
  Jupyter, diapositivas reveal.js y los guiones =.inp= tangled. Se
  reconstruye por completo cada vez que se despliega; no tiene historia
  "significativa" propia, es un espejo del estado actual de =main=.

Esta separación evita mezclar en el historial de =main= cambios de
contenido con cambios puramente mecánicos de regeneración, y mantiene el
repositorio ligero.

* Estructura de directorios (resumen)

| Ruta                        | Contenido                                    | ¿Se versiona en =main=? |
|------------------------------+-----------------------------------------------+---------------------------|
| =org-lessons/*.org=          | Sesiones teóricas                             | Sí                        |
| =org-lessons/img/=           | Figuras                                       | Sí                        |
| =org-pract/*.org=            | Guiones de laboratorio (fuente)               | Sí                        |
| =org-pract/guiones/*.inp=    | Script Gretl tangled                          | No (generado)             |
| =CuadernosElectronicos/*.org=| Cuadernos complementarios (fuente, si los hay) | Sí                        |
| =data/=                      | Datasets                                      | Sí                        |
| =css/=                       | Temas de exportación HTML                     | Sí                        |
| =index.org=                  | Fuente de la portada de =gh-pages=            | Sí                        |
| =*.pdf=, =*.html=, =*.ipynb=, =*.slides.html= | Artefactos              | No (solo en =gh-pages=)   |

* Estrategia B (actual): build local + despliegue manual

** Requisitos en la máquina local

Emacs + scimax, Gretl (=gretlcli=), una distribución LaTeX con soporte
=minted= (=--shell-escape= + =pygments=), y Jupyter con =nbconvert=. Todo
ello ya está operativo en la máquina de trabajo habitual del autor: no
se reinstala nada en cada publicación, a diferencia de lo que ocurriría
con integración continua (ver Estrategia A).

** Compilar todo

#+begin_src sh
make all index
#+end_src

Esto genera, dentro de =org-lessons/=, =org-pract/= y
=CuadernosElectronicos/=, todos los PDF, HTML, =.ipynb= y diapositivas, y
tangla + ejecuta los guiones de Gretl de las prácticas. También genera
=index.html= a partir de =index.org=.

* Preparar la rama =gh-pages= (una sola vez, ya hecho)

#+begin_src sh :eval no
git checkout --orphan gh-pages
git rm -rf --cached .
git commit --allow-empty -m "Rama gh-pages: sitio publicado (contenidos generados)"
git push origin gh-pages
git checkout main
git worktree add _ghpages gh-pages
#+end_src

#+RESULTS:
| rm        | '.gitignore'                                                    |          |      |           |       |           |             |            |
| rm        | 'CuadernosElectronicos/S05-Notebook01.org'                      |          |      |           |       |           |             |            |
| rm        | 'DEPLOYMENT.org'                                                |          |      |           |       |           |             |            |
| rm        | 'LICENSE'                                                       |          |      |           |       |           |             |            |
| rm        | 'LICENSE-CODE'                                                  |          |      |           |       |           |             |            |
| rm        | 'README.org'                                                    |          |      |           |       |           |             |            |
| rm        | 'css/bigblow_inline.theme'                                      |          |      |           |       |           |             |            |
| rm        | 'css/readtheorg_inline.theme'                                   |          |      |           |       |           |             |            |
| rm        | 'css/simple_inlineUCM.theme'                                    |          |      |           |       |           |             |            |
| rm        | 'data/boston.csv'                                               |          |      |           |       |           |             |            |
| rm        | 'deploy-gh-pages.sh'                                            |          |      |           |       |           |             |            |
| rm        | 'index.org'                                                     |          |      |           |       |           |             |            |
| rm        | 'makefile'                                                      |          |      |           |       |           |             |            |
| rm        | 'mycfg-GitHubPages.py'                                          |          |      |           |       |           |             |            |
| rm        | 'org-lessons/00preambulo_lecciones.txt'                         |          |      |           |       |           |             |            |
| rm        | 'org-lessons/S01-Lecc01.org'                                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/S02-Lecc02.org'                                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/S03-Lecc03.org'                                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/S05-Lecc04.org'                                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/S06-Lecc05.org'                                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/LongitudVectorR2.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/LongitudVectorR3.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/LongitudVector_fila.png'            |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/LongitudVector_fila_ancho.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/ProductoPorEscalar.png'             |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/SumaVectores.png'                   |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/VectorEnR2.png'                     |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S02-Lecc02/resultado_final.png'                |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad1.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad2.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad3.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad4.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad5.png'      |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad_fila.png'  |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/LongitudVectorR2.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/LongitudVectorR3.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/LongitudVector_fila.png'            |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/ProyeccionOrtogonal1.png'           |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/ProyeccionOrtogonal1_ancho.png'     |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/Triangulo1.png'                     |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/Triangulo2.png'                     |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/Triangulo_fila.png'                 |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S03-Lecc03/resultado_fila.png'                 |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionT1.png'                   |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionT2.png'                   |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionT3.png'                   |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionT_fila_ancho.png'         |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionTipica0.png'              |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionTipica0_ancho.png'        |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionTipica1.png'              |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/DesviacionTipica1_ancho.png'        |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/MediaAritmetica1.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/MediaAritmetica1_ancho.png'         |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/MediaAritmetica2.png'               |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/MediaAritmetica2_ancho.png'         |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/ProyeccionOrtogonal1_muy_ancho.png' |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/SumaCte.png'                        |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/SumaCte_ancho.png'                  |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/SumaMediaNula.png'                  |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/SumaMediaNula_ancho.png'            |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S05-Lecc04/figuras-S05-Lecc04.org'             |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/Correlacion.png'                    |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/Correlacion2.png'                   |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/Correlacion_fila_ancho.png'         |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/Varianza.png'                       |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/Varianza_ancho.png'                 |          |      |           |       |           |             |            |
| rm        | 'org-lessons/img/S06-Lecc05/figuras-S06-Lecc05.org'             |          |      |           |       |           |             |            |
| rm        | 'org-pract/00preambulo_practicas.txt'                           |          |      |           |       |           |             |            |
| rm        | 'org-pract/S04-Prct-A-hprice2.org'                              |          |      |           |       |           |             |            |
| rm        | 'org-pract/S04-Prct-B-boston.org'                               |          |      |           |       |           |             |            |
| rm        | 'requirements.txt'                                              |          |      |           |       |           |             |            |
| [gh-pages | (commit-raíz)                                                   | e9a3999] | Rama | gh-pages: | sitio | publicado | (contenidos | generados) |

El directorio =_ghpages/= es un /worktree/ de git: la misma repositorio,
pero con la rama =gh-pages= pagada en esa carpeta. Permite tener =main= y
=gh-pages= abiertos simultáneamente sin cambiar de rama. Esta carpeta está
en =.gitignore= de =main= (no debe versionarse ahí).

* Desplegar

#+begin_src sh
./deploy-gh-pages.sh
#+end_src

#+RESULTS:
| make:     | No       |        se | hace                                                          | nada          | para                    | 'all'.              |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| make:     | No       |        se | hace                                                          | nada          | para                    | 'index'.            |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| [gh-pages | 95c507a] | Actualiza | material                                                      | generado      | (2026-07-15)            |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| 185       | files    |  changed, | 35763                                                         | insertions(+) |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | .github/workflows/build.yml                                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | .gitignore                                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | .projectile                                                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | ConfRepo.org                                                  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Claude.org                                          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Curso.org                                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Curso.pdf                                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Curso.tex                                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Descartes.org                                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/DocumentoRector.org                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/DocumentoRector.pdf                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/DocumentoRector.tex                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Enlaces.org                                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/Lecc01.ipynb                                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/NotasEmacsLatexMinted.org                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscritura.html                                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscritura.org                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscritura.pdf                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscritura.tex                                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscrituraDelCurso.org                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscrituraDelCurso.pdf                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/PlanDeEscrituraDelCurso.tex                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/ValoracionGTP.org                                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/CosenoCirculoRadioUnidad1.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/CosenoCirculoRadioUnidad2.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/CosenoCirculoRadioUnidad3.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/CosenoCirculoRadioUnidad4.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/CosenoCirculoRadioUnidad5.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/LongitudVectorR2.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/LongitudVectorR3.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/ProyeccionOrtogonal1.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/Triangulo1.png                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/img/sesion03/Triangulo2.png                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/notasSobreClaudeyGptel.org                          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/pensamientoGemini.org                               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/plan-docente.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/proyeccion_ortogonal_econometria.html               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/proyeccion_ortogonal_econometria.org                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/proyeccion_ortogonal_econometria.pdf                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/proyeccion_ortogonal_econometria.tex                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/sesion01.nav                                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/sesion01.pdf                                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/sesion01.snm                                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Consultas/sesion01.tex                                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | CuadernosElectronicos/PreparacionNotebook.txt-org             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | CuadernosElectronicos/S05-Notebook01.org                      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | DEPLOYMENT.org                                                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | DEPLOYMENT.pdf                                                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | DEPLOYMENT.tex                                                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | "Ficha/FPE_2_1_Principios                                     | de            | Econometr\303\255a.pdf" |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | LICENSE                                                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | LICENSE-CODE                                                  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Lecturas/Bjerkholt_hist_thou.pdf                              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | Lecturas/Kennedy-TeachingUndergraduateEconometrics-1998.pdf   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | "Lecturas/Manuales/Joshua                                     | D.            | Angrist,                | J\303\266rn-Steffen | Pischke | -   | Mastering | \342\200\231Metrics_ | The   | Path | from   | Cause | to       | Effect-Princeton | University | Press | (2015).pdf" |
| create    | mode     |    100644 | Lecturas/Manuales/The                                         | book          | of                      | why_                | the     | new | science   | of                   | cause | and  | effect | (     | PDFDrive | ).pdf            |            |       |             |
| create    | mode     |    100644 | Lecturas/causal_educ_earnings.pdf                             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | README.org                                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | README.pdf                                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | README.tex                                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | css/bigblow_inline.theme                                      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | css/readtheorg_inline.theme                                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | css/simple_inlineUCM.theme                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | data/boston.csv                                               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100755 | deploy-gh-pages.sh                                            |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | index.html                                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | index.org                                                     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | makefile                                                      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | mycfg-GitHubPages.py                                          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/00preambulo_lecciones.txt                         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/PlanDeEscritura.tex                               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/PlanDeEscritura.txt-org                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/Revisi\303\263n.txt-org                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S01-Lecc01.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S01-Lecc01.tex                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S02-Lecc02.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S02-Lecc02.tex                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S03-Lecc03.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S03-Lecc03.tex                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S05-Lecc04.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S05-Lecc04.tex                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S06-Lecc05.org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/S06-Lecc05.tex                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/SXX-LeccYY.txt-org                                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/SYY-LeccXX-scratch.txt-org                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/bibliografia.bib                                  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/buffer.txt-org                                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/OperacionesConPNGs.org                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/LongitudVectorR2.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/LongitudVectorR3.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/LongitudVector_fila.png            |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/LongitudVector_fila_ancho.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/ProductoPorEscalar.png             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/ProductoPorEscalar.tex             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/SumaVectores.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/SumaVectores.tex                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/VectorEnR2.png                     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/VectorEnR2.tex                     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S02-Lecc02/resultado_final.png                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad1.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad2.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad3.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad4.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad5.png      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/CosenoCirculoRadioUnidad_fila.png  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/LongitudVectorR2.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/LongitudVectorR3.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/LongitudVector_fila.png            |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/ProyeccionOrtogonal1.png           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/ProyeccionOrtogonal1_ancho.png     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/S03-Lecc03.ipynb                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/Triangulo1.png                     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/Triangulo2.png                     |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/Triangulo_fila.png                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/prueba2.ipynb                      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S03-Lecc03/resultado_fila.png                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionT1.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionT2.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionT3.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionT_fila_ancho.png         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionTipica0.png              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionTipica0_ancho.png        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionTipica1.png              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/DesviacionTipica1_ancho.png        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/MediaAritmetica1.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/MediaAritmetica1_ancho.png         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/MediaAritmetica2.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/MediaAritmetica2_ancho.png         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/ProyeccionOrtogonal1_muy_ancho.png |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/SumaCte.png                        |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/SumaCte_ancho.png                  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/SumaMediaNula.png                  |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/SumaMediaNula_ancho.png            |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/figuras-S05-Lecc04.org             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/DesviacionT1.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/DesviacionT2.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/DesviacionT3.png               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/DesviacionTipica0.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/DesviacionTipica1.png          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/MediaAritmetica1.png           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/MediaAritmetica2.png           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/SumaCte.png                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/png/SumaMediaNula.png              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT1.pdf               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT1.tex               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT2.pdf               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT2.tex               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT3.pdf               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionT3.tex               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionTipica0.pdf          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionTipica0.tex          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionTipica1.pdf          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/DesviacionTipica1.tex          |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/MediaAritmetica1.pdf           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/MediaAritmetica1.tex           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/MediaAritmetica2.pdf           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/MediaAritmetica2.tex           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/S05-Lecc04.ipynb               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/SumaCte.pdf                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/SumaCte.tex                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/SumaMediaNula.pdf              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/SumaMediaNula.tex              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S05-Lecc04/tex/makefile                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/Correlacion.png                    |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/Correlacion2.png                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/Correlacion_fila_ancho.png         |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/S06-Lecc05.ipynb                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/Varianza.png                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/Varianza_ancho.png                 |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/figuras-S06-Lecc05.org             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/figuras-S06-Lecc05.pdf             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/figuras-S06-Lecc05.tex             |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/tex/Correlacion.tex                |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/tex/Correlacion2.tex               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/tex/Varianza.tex                   |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-lessons/img/S06-Lecc05/tex/makefile                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/00preambulo_practicas.txt                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/S04-Prct-A-hprice2.org                              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/S04-Prct-A-hprice2.tex                              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/S04-Prct-B-boston.org                               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/S04-Prct-B-boston.tex                               |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/guiones/S04-Prct-A-hprice2.inp                      |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/guiones/S04-Prct-B-boston.inp                       |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | org-pract/hansl.tex                                           |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |
| create    | mode     |    100644 | requirements.txt                                              |               |                         |                     |         |     |           |                      |       |      |        |       |          |                  |            |       |             |

El script (véase su código en el repositorio) copia cada artefacto
generado a la subcarpeta correspondiente de =_ghpages/= y hace commit +
push directamente sobre =gh-pages=.

* Publicar en GitHub Pages

/Settings → Pages → Source: Deploy from a branch → =gh-pages= / =(root)=/.

- Estrategia A (futura, si se desea automatizar con CI)

Si en el futuro se prefiere que la publicación ocurra automáticamente en
cada =push= a =main= (sin depender de ejecutar el script a mano), la vía
es GitHub Actions. Se documenta aquí para no tener que rediseñarlo desde
cero, pero /no está activada/ por defecto.

* Coste y riesgos a tener en cuenta

- Instalar Emacs + scimax + Gretl + una distribución LaTeX completa en
  cada ejecución del workflow es lento (varios minutos) y fràgil: scimax
  puede intentar compilar paquetes de MELPA la primera vez.
- No hay reconstrucción incremental real entre ejecuciones de CI (el
  =checkout= siempre parte limpio), aunque el =Makefile= use timestamps.
- Mejora natural: empaquetar toda la cadena de herramientas (Emacs,
  scimax, Gretl, TeXLive, Jupyter) en una /imagen Docker/ propia,
  publicada en un registro (Docker Hub o GitHub Container Registry), y
  hacer que el =job= de Actions use esa imagen como =container:=. Esto
  evita reinstalar dependencias en cada ejecución y hace reproducible el
  entorno de compilación.

* Pasos para migrar a Estrategia A cuando se decida

1. Crear un =Dockerfile= con Emacs, scimax preinstalado y cacheado,
   Gretl, TeXLive (subconjunto: =texlive-xetex texlive-latex-extra
   texlive-fonts-extra latexmk=), =pygments= y Jupyter/nbconvert.
2. Publicar la imagen (p. ej. =ghcr.io/mbujosab/peconometria-build:latest=).
3. Activar el fichero =.github/workflows/build.yml= (ya escrito más abajo,
   /listo para usar/ una vez exista la imagen) cambiando el paso de
   instalación de dependencias por =container: ghcr.io/mbujosab/peconometria-build:latest=.
4. Verificar en un =workflow_dispatch= manual antes de dejarlo disparado
   por =push= a =main=.

* =.github/workflows/build.yml= (preparado, no activo por defecto)

#+begin_src yaml :tangle .github/workflows/build.yml.disabled
name: Build y despliegue a gh-pages

on:
  push:
    branches: [main]
    paths:
      - 'org-lessons/**'
      - 'org-pract/**'
      - 'CuadernosElectronicos/**'
      - 'index.org'
  workflow_dispatch:

permissions:
  contents: write

jobs:
  build:
    runs-on: ubuntu-latest
    # Cuando exista la imagen Docker propia, sustituir el paso de
    # "Instalar dependencias" por:
    #   container: ghcr.io/mbujosab/peconometria-build:latest
    steps:
      - uses: actions/checkout@v4

      - name: Instalar dependencias
        run: |
          sudo apt-get update
          sudo apt-get install -y emacs-nox gretl \
            texlive-xetex texlive-latex-extra texlive-fonts-extra latexmk
          pip install jupyter nbconvert pygments

      - name: Clonar scimax
        run: git clone --depth 1 https://github.com/jkitchin/scimax.git $HOME/Software/scimax

      - name: make all
        run: make all index

      - name: Preparar sitio
        run: |
          mkdir -p _site/{Transparencias,Lecciones-html,Lecciones-pdf,Practicas-html/guiones,Practicas-pdf,CuadernosElectronicos}
          find org-lessons -maxdepth 1 -name '*.slides.html' -exec cp {} _site/Transparencias/ \;
          find org-lessons -maxdepth 1 -name '*.html' ! -name '*.slides.html' -exec cp {} _site/Lecciones-html/ \;
          find org-lessons -maxdepth 1 -name '*.pdf'  -exec cp {} _site/Lecciones-pdf/ \;
          find org-lessons -maxdepth 1 -name '*.ipynb' -exec cp {} _site/CuadernosElectronicos/ \;
          find org-pract -maxdepth 1 -name '*.html' -exec cp {} _site/Practicas-html/ \;
          find org-pract -maxdepth 1 -name '*.pdf'  -exec cp {} _site/Practicas-pdf/ \;
          find org-pract/guiones -maxdepth 1 -name '*.inp' -exec cp {} _site/Practicas-html/guiones/ \;
          find CuadernosElectronicos -maxdepth 1 -name '*.ipynb' -exec cp {} _site/CuadernosElectronicos/ \;
          cp requirements.txt _site/
          cp index.html _site/

      - name: Desplegar a gh-pages
        uses: peaceiris/actions-gh-pages@v4
        with:
          github_token: ${{ secrets.GITHUB_TOKEN }}
          publish_dir: ./_site
          publish_branch: gh-pages
#+end_src

